Catalogs/ДокументыЦессии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ДокументыЦессии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерЦессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорЦессииДокумент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыЦессииДоговорЦессии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КопияПлатежногоПоручения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыЦессииКопияПлатежногоПоручения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КопияРеестраУступаемыхПрав</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыЦессииКопияРеестраУступаемыхПрав</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДокументыЦессии/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура НомерЦессииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	  
     СтандартнаяОбработка=Ложь;
	 ОповещениеОЗакрытии=Новый ОписаниеОповещения("ДанныеВыбораЦессии",ЭтаФорма);

	 ОткрытьФорму("Справочник.ДоговорЦессии.Форма.ФормаВыбораРазличные",,ЭтаФорма,,,,ОповещениеОЗакрытии); 
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ДанныеВыбораЦессии(РезультатЗакрытия,ДополнительныеПараметры) Экспорт

	
	
		 Если РезультатЗакрытия= Неопределено Тогда
		      Возврат;
		
	     Иначе
			 
			Объект.Наименование= РезультатЗакрытия.НомерДоговора;
			Объект.НомерЦессии= РезультатЗакрытия.НомерДоговора;
			 
	     КонецЕсли;
					  
	

КонецПроцедуры

&НаКлиенте
Процедура ДоговорЦессииДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	  стрДанный=ЕстьЛиВладелец(Объект.Ссылка,"ЦессииДокумент");
	
	 Если стрДанный.результат Тогда
		 
		   ОповещениеОЗакрытии=Новый ОписаниеОповещения("ДанныеВыбора",ЭтаФорма);

		   данныеПередать=Новый Структура;
		   
		   
		   
    	   данныеПередать.Вставить("Ключ",стрДанный.ссылка);
	    
	       данныеПередать.Вставить("НомерЦессии",Объект.НомерЦессии);

		   данныеПередать.Вставить("ЭтоНеНовый",Истина);
		   
		  
	      ОткрытьФорму("Справочник.ДокументыЦессииДоговорЦессии.Форма.ФормаЭлемента",данныеПередать,Объект.Ссылка,,,,ОповещениеОЗакрытии);
	  

		 
		 
	 Иначе	 
		 
		ОповещениеОЗакрытии=Новый ОписаниеОповещения("ДанныеВыбора",ЭтаФорма);
	    
	    данныеПередать=Новый Структура;
	    
	    данныеПередать.Вставить("Владелец",Объект.Ссылка);
	    
	    данныеПередать.Вставить("НомерЦессии",Объект.НомерЦессии);

	   ОткрытьФорму("Справочник.ДокументыЦессииДоговорЦессии.Форма.ФормаЭлемента",данныеПередать,Объект.Ссылка,,,,ОповещениеОЗакрытии);
	  

	 
	 КонецЕсли;
	
	
	 	
	
КонецПроцедуры



&НаСервере
Функция ЕстьЛиВладелец(ссылка,имякнопки)

	стрВозврат=Новый Структура;
	
	Запрос = Новый Запрос;
	Если имякнопки="ЦессииДокумент" Тогда
	  Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыЦессииДоговорЦессии.Владелец КАК Владелец,
		|	ДокументыЦессииДоговорЦессии.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДокументыЦессииДоговорЦессии КАК ДокументыЦессииДоговорЦессии
		|ГДЕ
		|	ДокументыЦессииДоговорЦессии.Владелец = &Владелец";
	
		
	
	КонецЕсли;
	
	Если имякнопки="КопияПлатежногоПоручения" Тогда
	
		   Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыЦессииКопияПлатежногоПоручения.Ссылка КАК Ссылка,
		|	ДокументыЦессииКопияПлатежногоПоручения.Владелец КАК Владелец
		|ИЗ
		|	Справочник.ДокументыЦессииКопияПлатежногоПоручения КАК ДокументыЦессииКопияПлатежногоПоручения
		|ГДЕ
		|	ДокументыЦессииКопияПлатежногоПоручения.Владелец = &Владелец";
	
	

	
	КонецЕсли;
	
	
	
	
	Если имякнопки="КопияРеестраУступаемыхПрав" Тогда
		
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДокументыЦессииКопияРеестраУступаемыхПрав.Ссылка КАК Ссылка,
			|	ДокументыЦессииКопияРеестраУступаемыхПрав.Владелец КАК Владелец
			|ИЗ
			|	Справочник.ДокументыЦессииКопияРеестраУступаемыхПрав КАК ДокументыЦессииКопияРеестраУступаемыхПрав
			|ГДЕ
			|	ДокументыЦессииКопияРеестраУступаемыхПрав.Владелец = &Владелец";
		
				
	
	КонецЕсли;
	
	

	
	
	Запрос.УстановитьПараметр("Владелец", ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
		
		ВыборкаДетальныеЗаписи.Следующий();
		стрВозврат.Вставить("результат",Истина);
		стрВозврат.Вставить("ссылка",ВыборкаДетальныеЗаписи.Ссылка);
		
		
	Иначе	
            ВыборкаДетальныеЗаписи.Следующий();		
       		стрВозврат.Вставить("результат",Ложь);
    		стрВозврат.Вставить("ссылка",ВыборкаДетальныеЗаписи.Ссылка);
		
 		
				

	
	КонецЕсли;
	
	
	Возврат стрВозврат;
	

КонецФункции // ()


   



&НаКлиенте
Процедура ДанныеВыбора(РезультатЗакрытия,ДополнительныеПараметры) Экспорт

	
	
		 Если РезультатЗакрытия= Неопределено Тогда
		      Возврат;
		
		  Иначе
			    Объект.ДоговорЦессииДокумент=РезультатЗакрытия;
				ДоговорЦессииДокумент=Строка(РезультатЗакрытия);
			  
		 КонецЕсли;  
		  
	

КонецПроцедуры
	 


	 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если  Объект.ДоговорЦессииДокумент.Пустая()  Тогда
		
		
	Иначе	
		
		ДоговорЦессииДокумент=Строка(Объект.ДоговорЦессииДокумент);
		
	
	КонецЕсли;
	
	
   Если  Объект.КопияПлатежногоПоручения.Пустая()  Тогда
		
		
	Иначе	
		
		КопияПлатежногоПоручения=Строка(Объект.КопияПлатежногоПоручения);
		
	
	КонецЕсли;
	
	
	 Если  Объект.КопияРеестраУступаемыхПрав.Пустая()  Тогда
		
		
	Иначе	
		
		КопияРеестраУступаемыхПрав=Строка(Объект.КопияРеестраУступаемыхПрав);
		
	
	КонецЕсли;
	

	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура КопияПлатежногоПорученияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	    стрДанный=ЕстьЛиВладелец(Объект.Ссылка,"КопияПлатежногоПоручения");

			
	    		
	 Если стрДанный.результат Тогда
	     
	       ОповещениеОЗакрытии=Новый ОписаниеОповещения("ДанныеВыбораПлатежПоручение",ЭтаФорма);

	       данныеПередать=Новый Структура;
	       
	       
	       
	       данныеПередать.Вставить("Ключ",стрДанный.ссылка);
	    
	       данныеПередать.Вставить("НомерЦессии",Объект.НомерЦессии);

	       данныеПередать.Вставить("ЭтоНеНовый",Истина);
	       
	      
	      ОткрытьФорму("Справочник.ДокументыЦессииКопияПлатежногоПоручения.Форма.ФормаЭлемента",данныеПередать,Объект.Ссылка,,,,ОповещениеОЗакрытии);
	  

	     
	     
	 Иначе	 
	     
	    ОповещениеОЗакрытии=Новый ОписаниеОповещения("ДанныеВыбораПлатежПоручение",ЭтаФорма);
	    
	    данныеПередать=Новый Структура;
	    
	    данныеПередать.Вставить("Владелец",Объект.Ссылка);
	    
	    данныеПередать.Вставить("НомерЦессии",Объект.НомерЦессии);

	   ОткрытьФорму("Справочник.ДокументыЦессииКопияПлатежногоПоручения.Форма.ФормаЭлемента",данныеПередать,Объект.Ссылка,,,,ОповещениеОЗакрытии);
	  

	 
	 КонецЕсли;
	

	
	
	
 КонецПроцедуры
 
 
 &НаКлиенте
Процедура ДанныеВыбораПлатежПоручение(РезультатЗакрытия,ДополнительныеПараметры) Экспорт

	
	
		 Если РезультатЗакрытия= Неопределено Тогда
		      Возврат;
		
		  Иначе
			    Объект.КопияПлатежногоПоручения=РезультатЗакрытия;
				КопияПлатежногоПоручения=Строка(РезультатЗакрытия);
			  
		 КонецЕсли;  
		  
	

КонецПроцедуры

&НаКлиенте
Процедура КопияРеестраУступаемыхПравНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
	      стрДанный=ЕстьЛиВладелец(Объект.Ссылка,"КопияРеестраУступаемыхПрав");

			
	    		
	 Если стрДанный.результат Тогда
	     
	       ОповещениеОЗакрытии=Новый ОписаниеОповещения("ДанныеВыбораРеестраУступаемыхПрав",ЭтаФорма);

	       данныеПередать=Новый Структура;
	       
	       
	       
	       данныеПередать.Вставить("Ключ",стрДанный.ссылка);
	    
	       данныеПередать.Вставить("НомерЦессии",Объект.НомерЦессии);

	       данныеПередать.Вставить("ЭтоНеНовый",Истина);
	       
	      
	      ОткрытьФорму("Справочник.ДокументыЦессииКопияРеестраУступаемыхПрав.Форма.ФормаЭлемента",данныеПередать,Объект.Ссылка,,,,ОповещениеОЗакрытии);
	  

	     
	     
	 Иначе	 
	     
	    ОповещениеОЗакрытии=Новый ОписаниеОповещения("ДанныеВыбораРеестраУступаемыхПрав",ЭтаФорма);
	    
	    данныеПередать=Новый Структура;
	    
	    данныеПередать.Вставить("Владелец",Объект.Ссылка);
	    
	    данныеПередать.Вставить("НомерЦессии",Объект.НомерЦессии);

	   ОткрытьФорму("Справочник.ДокументыЦессииКопияРеестраУступаемыхПрав.Форма.ФормаЭлемента",данныеПередать,Объект.Ссылка,,,,ОповещениеОЗакрытии);
	  

	 
	 КонецЕсли;
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ДанныеВыбораРеестраУступаемыхПрав(РезультатЗакрытия,ДополнительныеПараметры) Экспорт

	
	
		 Если РезультатЗакрытия= Неопределено Тогда
		      Возврат;
		
		  Иначе
			    Объект.КопияРеестраУступаемыхПрав=РезультатЗакрытия;
				КопияРеестраУступаемыхПрав=Строка(РезультатЗакрытия);
			  
		 КонецЕсли;  
		  
	

КонецПроцедуры
